renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/7_SPI_driver/Examples/SPI_Example2_SyncTxRx_1Ch_1Job_1Seq/Autosar/Mcal/Base/header/S32K148_M4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LMEM</name>
      <description>LMEM</description>
      <groupName>LMEM</groupName>
      <baseAddress>0xE0082000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PCCCR</name>
          <description>Cache control register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENCACHE</name>
              <description>Cache enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENCACHE_0</name>
                  <description>Cache disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENCACHE_1</name>
                  <description>Cache enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCCR2</name>
              <description>Forces all cacheable spaces to write through</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCCR3</name>
              <description>Forces no allocation on cache misses (must also have PCCR2 asserted)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVW0</name>
              <description>Invalidate Way 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVW0_0</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVW0_1</name>
                  <description>When setting the GO bit, invalidate all lines in way 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUSHW0</name>
              <description>Push Way 0</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUSHW0_0</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHW0_1</name>
                  <description>When setting the GO bit, push all modified lines in way 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVW1</name>
              <description>Invalidate Way 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVW1_0</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVW1_1</name>
                  <description>When setting the GO bit, invalidate all lines in way 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUSHW1</name>
              <description>Push Way 1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUSHW1_0</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHW1_1</name>
                  <description>When setting the GO bit, push all modified lines in way 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GO</name>
              <description>Initiate Cache Command</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GO_0</name>
                  <description>Write: no effect. Read: no cache command active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GO_1</name>
                  <description>Write: initiate command indicated by bits 27-24. Read: cache command active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCCLCR</name>
          <description>Cache line control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LGO</name>
              <description>Initiate Cache Line Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LGO_0</name>
                  <description>Write: no effect. Read: no line command active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LGO_1</name>
                  <description>Write: initiate line command indicated by bits 27-24. Read: line command active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHEADDR</name>
              <description>Cache address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WSEL</name>
              <description>Way select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WSEL_0</name>
                  <description>Way 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WSEL_1</name>
                  <description>Way 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDSEL</name>
              <description>Tag/Data Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TDSEL_0</name>
                  <description>Data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDSEL_1</name>
                  <description>Tag</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCIVB</name>
              <description>Line Command Initial Valid Bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCIMB</name>
              <description>Line Command Initial Modified Bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCWAY</name>
              <description>Line Command Way</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCMD</name>
              <description>Line Command</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCMD_0</name>
                  <description>Search and read or write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCMD_1</name>
                  <description>Invalidate</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCMD_2</name>
                  <description>Push</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCMD_3</name>
                  <description>Clear</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LADSEL</name>
              <description>Line Address Select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LADSEL_0</name>
                  <description>Cache address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LADSEL_1</name>
                  <description>Physical address</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LACC</name>
              <description>Line access type</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LACC_0</name>
                  <description>Read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LACC_1</name>
                  <description>Write</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCCSAR</name>
          <description>Cache search address register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LGO</name>
              <description>Initiate Cache Line Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LGO_0</name>
                  <description>Write: no effect. Read: no line command active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LGO_1</name>
                  <description>Write: initiate line command indicated by bits CLCR[27:24]. Read: line command active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYADDR</name>
              <description>Physical Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCCCVR</name>
          <description>Cache read/write value register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Cache read/write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
